9/data/attachments/6b089ac8995df28e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6e2c9cea-0d10-4338-8b40-66eaf03f2c02</nif:username>
            <nif:friendToBeAdded>Joseph_owner_Friend_82404_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>